---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.EndCap
source: html/545d437e-a6b3-bfcb-97c2-d16106669744.htm
---
# Autodesk.Revit.DB.CompoundStructure.EndCap Property

Indicates the end cap condition defining which shell layers will participate in end wrapping.

## Syntax (C#)
```csharp
public EndCapCondition EndCap { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration